/*
	格式化并显示整数和浮点数
*/

#include <stdio.h>  %d 是整数格式化输出  %f 是浮点数格式化输出

int main(void)
{
	printf("[%d]\n",      123); /* 123 */		%d 表示整数格式化输出
	printf("[%.4d]\n",    123); /* 123.0000 */		%.4d 表示小数点后4位，不足时用0填充
	printf("[%4d]\n",     123); /* 123   */		%4d 表示宽度为4，不足时用空格填充
	printf("[%04d]\n",    123); /* 0123 */		%04d 表示宽度为4，不足时用0填充
	printf("[%-4d]\n\n",  123); /* 123  */		%-4d 表示宽度为4，不足时用空格填充

	printf("[%d]\n",      12345); /* 12345 */
	printf("[%.3d]\n",    12345); /* 12345 */		%.3d 表示小数点后3位，不足时用0填充
	printf("[%3d]\n",     12345); /* 12345 */		%3d 表示宽度为3，不足时用空格填充			
	printf("[%03d]\n",    12345); /* 12345 */		%03d 表示宽度为3，不足时用0填充
	printf("[%-3d]\n\n",  12345); /* 12345 */		%-3d 表示宽度为3，不足时用空格填充

	printf("[%f]\n",      123.13); /* 123.13 */		%f 表示浮点数格式化输出
	printf("[%.1f]\n",    123.13); /* 123.1 */		%.1f 表示小数点后1位，不足时用0填充
	printf("[%6.1f]\n\n", 123.13); /* 123.1 */		%6.1f 表示宽度为6，小数点后1位，不足时用空格填充

	printf("[%f]\n",      123.13); /* 123.13 */		%f 表示浮点数格式化输出
	printf("[%.1f]\n",    123.13); /* 123.1 */		%.1f 表示小数点后1位，不足时用0填充
	printf("[%4.1f]\n\n", 123.13); /* 123.1 */		%4.1f 表示宽度为4，小数点后1位，不足时用空格填充

	return 0; /* 返回值为0 */
}
